clear all;
close all;
clc;
%% 控制器设计要求:
% 1. 指令跟踪:上升时间(指达到终值的90%)应小于0.3s,超调亮应小于5%
% 2. 扰动抑制:对于单位阶跃响应,输出的响应在任何时刻都不应超出区间[-1,1],并且应该尽可能快的返回到0(|y(t)|在3s后至少小于0.1)
% 3. 输入约束:u(t)在所有的时间都应该在区间[-1,1]以内,以避免输入饱和
%
%%
s = tf('s');
G = 200/(10*s+1)/(0.05*s+1)^2;
Gd = 100/(10*s+1);

Wc = 10;
%% 0.逆基控制器
K0 = Wc/s*(10*s+1)/200 * (0.1*s + 1)/(0.01*s+1);
L0 = K0*G;
T0 = L0/(1+L0);
Td0 = Gd/(1+L0);
[GM0,PM0] = margin(L0)

%% 1.扰动抑制
K1 = 0.5;
L1 = K1*G;
T1 = L1/(1+L1);
Td1 = Gd/(1+L1);
[GM1,PM1] = margin(L1)

%% 2.扰动抑制低频积分(低频段增加增益)
K2 = 0.5*(s+2)/s;
L2 = K2*G;
T2 = L2/(1+L2);
Td2 = Gd/(1+L2);
[GM2,PM2] = margin(L2)

%% 3.高频矫正
K3 = K2*(0.05*s+1)/(0.005*s+1);
L3 = K3*G;
T3 = L3/(1+L3);
Td3 = Gd/(1+L3);
[GM3,PM3] = margin(L3)

T4 = (0.5*s+1)/(0.65*s+1)/(0.03*s+1)*T3;

%% plot data
subplot(1,2,1)
step(T0,T1,T2,T3,T4,3);grid on;
title('单位阶跃响应')
subplot(1,2,2)
step(Td0,Td1,Td2,Td3,3);grid on;
title('单位绕动相应');

figure;
bode(L0,L1,L2,L3);grid on;
legend('L0','L1','L2','L3')